Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RFMR" edc:nzwidth="0x20" edc:access="nnnn---n-nnnnnnn----nnnnn-nnnnnn" edc:impl="0xF17F0FBF" edc:_addr="0x40004014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="DATLEN" edc:nzwidth="0x5" edc:desc="Data Length"/>
            <edc:SFRFieldDef edc:cname="LOOP" edc:nzwidth="0x1" edc:desc="Loop Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MSBF" edc:nzwidth="0x1" edc:desc="Most Significant Bit First"/>
            <edc:SFRFieldDef edc:cname="DATNB" edc:nzwidth="0x4" edc:desc="Data Number per Frame"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSLEN" edc:nzwidth="0x4" edc:desc="Receive Frame Sync Length"/>
            <edc:SFRFieldDef edc:cname="FSOS" edc:nzwidth="0x3" edc:desc="Receive Frame Sync Output Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RF pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Driven Low during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Driven High during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLING" edc:desc="Toggling at each start of data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEDGE" edc:nzwidth="0x1" edc:desc="Frame Sync Edge Detection">
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Edge Detection" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Edge Detection" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FSLEN_EXT" edc:nzwidth="0x4" edc:desc="FSLEN Field Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_TCMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFFF0FFF" edc:_addr="0x40004018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="CKS" edc:nzwidth="0x2" edc:desc="Transmit Clock Selection">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Divided Clock" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RK" edc:desc="RK Clock signal" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TK" edc:desc="TK pin" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKO" edc:nzwidth="0x3" edc:desc="Transmit Clock Output Mode Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, TK pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous Transmit Clock, TK pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Transmit Clock only during data transfers, TK pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKI" edc:nzwidth="0x1" edc:desc="Transmit Clock Inversion"/>
            <edc:SFRFieldDef edc:cname="CKG" edc:nzwidth="0x2" edc:desc="Transmit Clock Gating Selection">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EN_TF_LOW" edc:desc="Transmit Clock enabled only if TF Low" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EN_TF_HIGH" edc:desc="Transmit Clock enabled only if TF High" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x4" edc:desc="Transmit Start Selection">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVE" edc:desc="Receive start" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TF_LOW" edc:desc="Detection of a low level on TF signal" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TF_HIGH" edc:desc="Detection of a high level on TF signal" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TF_FALLING" edc:desc="Detection of a falling edge on TF signal" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TF_RISING" edc:desc="Detection of a rising edge on TF signal" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TF_LEVEL" edc:desc="Detection of any level change on TF signal" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TF_EDGE" edc:desc="Detection of any edge on TF signal" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="STTDLY" edc:nzwidth="0x8" edc:desc="Transmit Start Delay"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0x8" edc:desc="Transmit Period Divider Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
