Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_TFMR" edc:nzwidth="0x20" edc:access="nnnn---nnnnnnnnn----nnnnn-nnnnnn" edc:impl="0xF1FF0FBF" edc:_addr="0x4000401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="DATLEN" edc:nzwidth="0x5" edc:desc="Data Length"/>
            <edc:SFRFieldDef edc:cname="DATDEF" edc:nzwidth="0x1" edc:desc="Data Default Value"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MSBF" edc:nzwidth="0x1" edc:desc="Most Significant Bit First"/>
            <edc:SFRFieldDef edc:cname="DATNB" edc:nzwidth="0x4" edc:desc="Data Number per Frame"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSLEN" edc:nzwidth="0x4" edc:desc="Transmit Frame Sync Length"/>
            <edc:SFRFieldDef edc:cname="FSOS" edc:nzwidth="0x3" edc:desc="Transmit Frame Sync Output Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, TF pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Pulse, TF pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Pulse, TF pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Driven Low during data transfer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Driven High during data transfer" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLING" edc:desc="Toggling at each start of data transfer" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSDEN" edc:nzwidth="0x1" edc:desc="Frame Sync Data Enable"/>
            <edc:SFRFieldDef edc:cname="FSEDGE" edc:nzwidth="0x1" edc:desc="Frame Sync Edge Detection">
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Edge Detection" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Edge Detection" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FSLEN_EXT" edc:nzwidth="0x4" edc:desc="FSLEN Field Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RHR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40004020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="RDAT" edc:nzwidth="0x20" edc:desc="Receive Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_THR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40004024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TDAT" edc:nzwidth="0x20" edc:desc="Transmit Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40004028"/>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RSHR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40004030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="RSDAT" edc:nzwidth="0x10" edc:desc="Receive Synchronization Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_TSHR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TSDAT" edc:nzwidth="0x10" edc:desc="Transmit Synchronization Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RC0R" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x10" edc:desc="Receive Compare Data 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RC1R" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000403C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x10" edc:desc="Receive Compare Data 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_SR" edc:nzwidth="0x20" edc:access="--------------rr----rrrr--rr--rr" edc:impl="0x30F33" edc:_addr="0x40004040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmit Empty"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x1" edc:desc="Compare 0"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x1" edc:desc="Compare 1"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:nzwidth="0x1" edc:desc="Transmit Sync"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:nzwidth="0x1" edc:desc="Receive Sync"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmit Enable"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receive Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_IER" edc:nzwidth="0x20" edc:access="--------------------wwww--ww--ww" edc:impl="0xF33" edc:_addr="0x40004044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmit Empty Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:nzwidth="0x1" edc:desc="Receive Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:nzwidth="0x1" edc:desc="Tx Sync Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:nzwidth="0x1" edc:desc="Rx Sync Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_IDR" edc:nzwidth="0x20" edc:access="--------------------wwww--ww--ww" edc:impl="0xF33" edc:_addr="0x40004048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmit Empty Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:nzwidth="0x1" edc:desc="Receive Overrun Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:nzwidth="0x1" edc:desc="Tx Sync Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:nzwidth="0x1" edc:desc="Rx Sync Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
