Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_IMR" edc:nzwidth="0x20" edc:access="--------------------rrrr--rr--rr" edc:impl="0xF33" edc:_addr="0x4000404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmit Empty Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:nzwidth="0x1" edc:desc="Receive Overrun Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:nzwidth="0x1" edc:desc="Tx Sync Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:nzwidth="0x1" edc:desc="Rx Sync Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x94" edc:_addr="0x40004050"/>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x535343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400040E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7F14" edc:_addr="0x400040EC"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL0TC0_CCR" edc:nzwidth="0x20" edc:access="-----------------------------www" edc:impl="0x7" edc:_addr="0x4000C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CLKEN" edc:nzwidth="0x1" edc:desc="Counter Clock Enable Command"/>
            <edc:SFRFieldDef edc:cname="CLKDIS" edc:nzwidth="0x1" edc:desc="Counter Clock Disable Command"/>
            <edc:SFRFieldDef edc:cname="SWTRG" edc:nzwidth="0x1" edc:desc="Software Trigger Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL0TC0_CMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4000C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="TCCLKS" edc:nzwidth="0x3" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK1" edc:desc="Clock selected: internal PCK6 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK2" edc:desc="Clock selected: internal MCK/8 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK3" edc:desc="Clock selected: internal MCK/32 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK4" edc:desc="Clock selected: internal MCK/128 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK5" edc:desc="Clock selected: internal SLCK clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="Clock selected: XC0" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="Clock selected: XC1" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="Clock selected: XC2" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKI" edc:nzwidth="0x1" edc:desc="Clock Invert"/>
            <edc:SFRFieldDef edc:cname="BURST" edc:nzwidth="0x2" edc:desc="Burst Signal Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="The clock is not gated by an external signal." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="XC0 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="XC1 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="XC2 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPCSTOP" edc:nzwidth="0x1" edc:desc="Counter Clock Stopped with RC Compare"/>
            <edc:SFRFieldDef edc:cname="CPCDIS" edc:nzwidth="0x1" edc:desc="Counter Clock Disable with RC Loading"/>
            <edc:SFRFieldDef edc:cname="EEVTEDG" edc:nzwidth="0x2" edc:desc="External Event Edge Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Rising edge" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EDGE" edc:desc="Each edges" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EEVT" edc:nzwidth="0x2" edc:desc="External Event Selection">
              <edc:SFRFieldSemantic edc:cname="TIOB" edc:desc="TIOB" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="XC0" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="XC1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="XC2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENETRG" edc:nzwidth="0x1" edc:desc="External Event Trigger Enable"/>
            <edc:SFRFieldDef edc:cname="WAVSEL" edc:nzwidth="0x2" edc:desc="Waveform Selection">
              <edc:SFRFieldSemantic edc:cname="UP" edc:desc="UP mode without automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="UPDOWN mode without automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UP_RC" edc:desc="UP mode with automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN_RC" edc:desc="UPDOWN mode with automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="CPCTRG" edc:nzwidth="0x1" edc:desc="RC Compare Trigger Enable"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:nzwidth="0x1" edc:desc="Waveform Mode"/>
            <edc:SFRFieldDef edc:cname="ACPA" edc:nzwidth="0x2" edc:desc="RA Compare Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACPC" edc:nzwidth="0x2" edc:desc="RC Compare Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AEEVT" edc:nzwidth="0x2" edc:desc="External Event Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASWTRG" edc:nzwidth="0x2" edc:desc="Software Trigger Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCPB" edc:nzwidth="0x2" edc:desc="RB Compare Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCPC" edc:nzwidth="0x2" edc:desc="RC Compare Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BEEVT" edc:nzwidth="0x2" edc:desc="External Event Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BSWTRG" edc:nzwidth="0x2" edc:desc="Software Trigger Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL0TC0_SMMR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4000C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="GCEN" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:SFRFieldDef edc:cname="DOWN" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL0TC0_RAB" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RAB" edc:nzwidth="0x20" edc:desc="Register A or Register B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL0TC0_CV" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
