Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4000C0B4"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_BCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4000C0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:nzwidth="0x1" edc:desc="Synchro Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_BMR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnn-nnnnnnnnnnn--nnnnnn" edc:impl="0x3FF7FF3F" edc:_addr="0x4000C0C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:nzwidth="0x2" edc:desc="External Clock Signal 0 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:nzwidth="0x2" edc:desc="External Clock Signal 1 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:nzwidth="0x2" edc:desc="External Clock Signal 2 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:nzwidth="0x1" edc:desc="Quadrature Decoder Enabled"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:nzwidth="0x1" edc:desc="Position Enabled"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:nzwidth="0x1" edc:desc="Speed Enabled"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:nzwidth="0x1" edc:desc="Quadrature Decoding Transparent"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:nzwidth="0x1" edc:desc="Edge on PHA Count Mode"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:nzwidth="0x1" edc:desc="Inverted PHA"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:nzwidth="0x1" edc:desc="Inverted PHB"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:nzwidth="0x1" edc:desc="Inverted Index"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:nzwidth="0x1" edc:desc="Swap PHA and PHB"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:nzwidth="0x1" edc:desc="Index Pin is PHB Pin"/>
            <edc:SFRFieldDef edc:cname="AUTOC" edc:nzwidth="0x1" edc:desc="AutoCorrection of missing pulses"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:nzwidth="0x6" edc:desc="Maximum Filter"/>
            <edc:SFRFieldDef edc:cname="MAXCMP" edc:nzwidth="0x4" edc:desc="Maximum Consecutive Missing Pulses"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_QIER" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x4000C0C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_QIDR" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x4000C0CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_QIMR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x4000C0D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_QISR" edc:nzwidth="0x20" edc:access="-----------------------r----rrrr" edc:impl="0x10F" edc:_addr="0x4000C0D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Direction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_FMR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4000C0D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:nzwidth="0x1" edc:desc="Enable Compare Fault Channel 0"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:nzwidth="0x1" edc:desc="Enable Compare Fault Channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4000C0DC"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x4000C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
