Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x20" edc:desc="Register A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RB" edc:nzwidth="0x20" edc:desc="Register B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_RC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4001009C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="RC" edc:nzwidth="0x20" edc:desc="Register C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_SR" edc:nzwidth="0x20" edc:access="-------------rrr--------rrrrrrrr" edc:impl="0x700FF" edc:_addr="0x400100A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:nzwidth="0x1" edc:desc="Clock Enabling Status"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:nzwidth="0x1" edc:desc="TIOAx Mirror"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:nzwidth="0x1" edc:desc="TIOBx Mirror"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400100A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400100A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_IMR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x400100AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC1" edc:cname="TC_CHANNEL2TC1_EMR" edc:nzwidth="0x20" edc:access="-----------------------n--nn--nn" edc:impl="0x133" edc:_addr="0x400100B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="TRIGSRCA" edc:nzwidth="0x2" edc:desc="Trigger Source for Input A">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOAx" edc:desc="The trigger/capture input A is driven by external pin TIOAx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="The trigger/capture input A is driven internally by PWMx" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRIGSRCB" edc:nzwidth="0x2" edc:desc="Trigger Source for Input B">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOBx" edc:desc="The trigger/capture input B is driven by external pin TIOBx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC)." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NODIVCLK" edc:nzwidth="0x1" edc:desc="No Divided Clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
