Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC_CHANNEL2TC2_IER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400140A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC_CHANNEL2TC2_IDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400140A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC_CHANNEL2TC2_IMR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x400140AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC_CHANNEL2TC2_EMR" edc:nzwidth="0x20" edc:access="-----------------------n--nn--nn" edc:impl="0x133" edc:_addr="0x400140B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="TRIGSRCA" edc:nzwidth="0x2" edc:desc="Trigger Source for Input A">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOAx" edc:desc="The trigger/capture input A is driven by external pin TIOAx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="The trigger/capture input A is driven internally by PWMx" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRIGSRCB" edc:nzwidth="0x2" edc:desc="Trigger Source for Input B">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOBx" edc:desc="The trigger/capture input B is driven by external pin TIOBx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC)." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NODIVCLK" edc:nzwidth="0x1" edc:desc="No Divided Clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400140B4"/>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_BCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x400140C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="SYNC" edc:nzwidth="0x1" edc:desc="Synchro Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_BMR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnn-nnnnnnnnnnn--nnnnnn" edc:impl="0x3FF7FF3F" edc:_addr="0x400140C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:nzwidth="0x2" edc:desc="External Clock Signal 0 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:nzwidth="0x2" edc:desc="External Clock Signal 1 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:nzwidth="0x2" edc:desc="External Clock Signal 2 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:nzwidth="0x1" edc:desc="Quadrature Decoder Enabled"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:nzwidth="0x1" edc:desc="Position Enabled"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:nzwidth="0x1" edc:desc="Speed Enabled"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:nzwidth="0x1" edc:desc="Quadrature Decoding Transparent"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:nzwidth="0x1" edc:desc="Edge on PHA Count Mode"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:nzwidth="0x1" edc:desc="Inverted PHA"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:nzwidth="0x1" edc:desc="Inverted PHB"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:nzwidth="0x1" edc:desc="Inverted Index"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:nzwidth="0x1" edc:desc="Swap PHA and PHB"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:nzwidth="0x1" edc:desc="Index Pin is PHB Pin"/>
            <edc:SFRFieldDef edc:cname="AUTOC" edc:nzwidth="0x1" edc:desc="AutoCorrection of missing pulses"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:nzwidth="0x6" edc:desc="Maximum Filter"/>
            <edc:SFRFieldDef edc:cname="MAXCMP" edc:nzwidth="0x4" edc:desc="Maximum Consecutive Missing Pulses"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_QIER" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x400140C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_QIDR" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x400140CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_QIMR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x400140D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_QISR" edc:nzwidth="0x20" edc:access="-----------------------r----rrrr" edc:impl="0x10F" edc:_addr="0x400140D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Index"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:nzwidth="0x1" edc:desc="Direction Change"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:nzwidth="0x1" edc:desc="Quadrature Error"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:nzwidth="0x1" edc:desc="Consecutive Missing Pulse Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Direction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
