Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ISR1" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x4002001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCM" edc:nzwidth="0x20" edc:access="--------nnnn--nn------------nnnn" edc:impl="0xF3000F" edc:_addr="0x40020020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="SYNC0" edc:nzwidth="0x1" edc:desc="Synchronous Channel 0"/>
            <edc:SFRFieldDef edc:cname="SYNC1" edc:nzwidth="0x1" edc:desc="Synchronous Channel 1"/>
            <edc:SFRFieldDef edc:cname="SYNC2" edc:nzwidth="0x1" edc:desc="Synchronous Channel 2"/>
            <edc:SFRFieldDef edc:cname="SYNC3" edc:nzwidth="0x1" edc:desc="Synchronous Channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="UPDM" edc:nzwidth="0x2" edc:desc="Synchronous Channels Update Mode">
              <edc:SFRFieldSemantic edc:cname="MODE0" edc:desc="Manual write of double buffer registers and manual update of synchronous channels" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Manual write of double buffer registers and automatic update of synchronous channels" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Automatic write of duty-cycle update registers by the DMA Controller and automatic update of synchronous channels" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PTRM" edc:nzwidth="0x1" edc:desc="DMA Controller Transfer Request Mode"/>
            <edc:SFRFieldDef edc:cname="PTRCS" edc:nzwidth="0x3" edc:desc="DMA Controller Transfer Request Comparison Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_DMAR" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40020024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="DMADUTY" edc:nzwidth="0x18" edc:desc="Duty-Cycle Holding Register for DMA Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUC" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40020028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPDULOCK" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Unlock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUP" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4002002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPR" edc:nzwidth="0x4" edc:desc="Update Period"/>
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:nzwidth="0x4" edc:desc="Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUPUPD" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40020030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPRUPD" edc:nzwidth="0x4" edc:desc="Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IER2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x40020034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IDR2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x40020038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IMR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x4002003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ISR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x40020040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
