Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4002005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPOL" edc:nzwidth="0x8" edc:desc="Fault Polarity"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:nzwidth="0x8" edc:desc="Fault Activation Mode"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:nzwidth="0x8" edc:desc="Fault Filtering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40020060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FIV" edc:nzwidth="0x8" edc:desc="Fault Input Value"/>
            <edc:SFRFieldDef edc:cname="FS" edc:nzwidth="0x8" edc:desc="Fault Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FCR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40020064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FCLR" edc:nzwidth="0x8" edc:desc="Fault Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FPV1" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40020068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVH3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVL3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FPE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4002006C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPE0" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="FPE3" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40020070"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ELMR0" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4002007C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ELMR1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40020080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
