Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LINMR" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x40024054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NACT" edc:nzwidth="0x2" edc:desc="LIN Node Action">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:nzwidth="0x1" edc:desc="Parity Disable"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:nzwidth="0x1" edc:desc="Checksum Disable"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:nzwidth="0x1" edc:desc="Checksum Type"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:nzwidth="0x1" edc:desc="Data Length Mode"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:nzwidth="0x1" edc:desc="Frame Slot Mode Disable"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:nzwidth="0x1" edc:desc="Wakeup Signal Type"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:nzwidth="0x8" edc:desc="Data Length Control"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:nzwidth="0x1" edc:desc="DMAC Mode"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:nzwidth="0x1" edc:desc="Synchronization Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LINIR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40024058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:nzwidth="0x8" edc:desc="Identifier Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LINBRR" edc:nzwidth="0x20" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:impl="0x7FFFF" edc:_addr="0x4002405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LINCD" edc:nzwidth="0x10" edc:desc="Clock Divider after Synchronization"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:nzwidth="0x3" edc:desc="Fractional Part after Synchronization"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn----------nnnnnn" edc:impl="0xFF003F" edc:_addr="0x40024060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="COMMT" edc:nzwidth="0x1" edc:desc="LON comm_type Parameter Value"/>
            <edc:SFRFieldDef edc:cname="COLDET" edc:nzwidth="0x1" edc:desc="LON Collision Detection Feature"/>
            <edc:SFRFieldDef edc:cname="TCOL" edc:nzwidth="0x1" edc:desc="Terminate Frame upon Collision Notification"/>
            <edc:SFRFieldDef edc:cname="CDTAIL" edc:nzwidth="0x1" edc:desc="LON Collision Detection on Frame Tail"/>
            <edc:SFRFieldDef edc:cname="DMAM" edc:nzwidth="0x1" edc:desc="LON DMA Mode"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:nzwidth="0x1" edc:desc="LON Collision Detection Source"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EOFS" edc:nzwidth="0x8" edc:desc="End of Frame Condition Size"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONPR" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:impl="0x3FFF" edc:_addr="0x40024064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONPL" edc:nzwidth="0xE" edc:desc="LON Preamble Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONDL" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40024068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONDL" edc:nzwidth="0x8" edc:desc="LON Data Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONL2HDR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4002406C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BLI" edc:nzwidth="0x6" edc:desc="LON Backlog Increment"/>
            <edc:SFRFieldDef edc:cname="ALTP" edc:nzwidth="0x1" edc:desc="LON Alternate Path Bit"/>
            <edc:SFRFieldDef edc:cname="PB" edc:nzwidth="0x1" edc:desc="LON Priority Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONBL" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x40024070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONBL" edc:nzwidth="0x6" edc:desc="LON Node Backlog Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONB1TX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40024074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BETA1TX" edc:nzwidth="0x18" edc:desc="LON Beta1 Length after Transmission"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONB1RX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40024078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BETA1RX" edc:nzwidth="0x18" edc:desc="LON Beta1 Length after Reception"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LONPRIO" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:impl="0x7F7F" edc:_addr="0x4002407C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="PSNB" edc:nzwidth="0x7" edc:desc="LON Priority Slot Number"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:nzwidth="0x7" edc:desc="LON Node Priority Slot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_IDTTX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40024080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDTTX" edc:nzwidth="0x18" edc:desc="LON Indeterminate Time after Transmission (comm_type = 1 mode only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
