Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_LONL2HDR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4002806C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="BLI" edc:nzwidth="0x6" edc:desc="LON Backlog Increment"/>
            <edc:SFRFieldDef edc:cname="ALTP" edc:nzwidth="0x1" edc:desc="LON Alternate Path Bit"/>
            <edc:SFRFieldDef edc:cname="PB" edc:nzwidth="0x1" edc:desc="LON Priority Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_LONBL" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x40028070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="LONBL" edc:nzwidth="0x6" edc:desc="LON Node Backlog Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_LONB1TX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40028074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="BETA1TX" edc:nzwidth="0x18" edc:desc="LON Beta1 Length after Transmission"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_LONB1RX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40028078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="BETA1RX" edc:nzwidth="0x18" edc:desc="LON Beta1 Length after Reception"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_LONPRIO" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:impl="0x7F7F" edc:_addr="0x4002807C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="PSNB" edc:nzwidth="0x7" edc:desc="LON Priority Slot Number"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:nzwidth="0x7" edc:desc="LON Node Priority Slot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_IDTTX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40028080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="IDTTX" edc:nzwidth="0x18" edc:desc="LON Indeterminate Time after Transmission (comm_type = 1 mode only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_IDTRX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40028084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="IDTRX" edc:nzwidth="0x18" edc:desc="LON Indeterminate Time after Reception (comm_type = 1 mode only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_ICDIFF" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40028088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="ICDIFF" edc:nzwidth="0x4" edc:desc="IC Differentiator Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x58" edc:_addr="0x4002808C"/>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400280E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400280E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7F14" edc:_addr="0x400280EC"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_CREL" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40030000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x8" edc:desc="Timestamp Day"/>
            <edc:SFRFieldDef edc:cname="MON" edc:nzwidth="0x8" edc:desc="Timestamp Month"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x4" edc:desc="Timestamp Year"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:nzwidth="0x4" edc:desc="Sub-step of Core Release"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:nzwidth="0x4" edc:desc="Step of Core Release"/>
            <edc:SFRFieldDef edc:cname="REL" edc:nzwidth="0x4" edc:desc="Core Release"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
