Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003008C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_XIDAM" edc:nzwidth="0x20" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFFF" edc:_addr="0x40030090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="EIDM" edc:nzwidth="0x1D" edc:desc="Extended ID Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_HPMS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40030094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="BIDX" edc:nzwidth="0x6" edc:desc="Buffer Index"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:nzwidth="0x2" edc:desc="Message Storage Indicator">
              <edc:SFRFieldSemantic edc:cname="NO_FIFO_SEL" edc:desc="No FIFO selected." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_0" edc:desc="Message stored in FIFO 0." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_1" edc:desc="Message stored in FIFO 1." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:nzwidth="0x7" edc:desc="Filter Index"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:nzwidth="0x1" edc:desc="Filter List"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_NDAT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ND0" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_NDAT2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003009C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ND32" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
