Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TXBRP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400300CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TRP0" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 0"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 2"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 3"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 4"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 5"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 6"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 7"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 8"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 9"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 10"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 11"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 12"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 13"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 14"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 15"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 16"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 17"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 18"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 19"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 20"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 21"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 22"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 23"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 24"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 25"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 26"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 27"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 28"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 29"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 30"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TXBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400300D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="AR0" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 0"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 2"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 3"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 4"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 5"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 6"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 7"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 8"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 9"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 10"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 11"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 12"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 13"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 14"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 15"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 16"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 17"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 18"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 19"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 20"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 21"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 22"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 23"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 24"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 25"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 26"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 27"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 28"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 29"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 30"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
