Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0x7F04" edc:_addr="0x400300FC"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVCTRL" edc:nzwidth="0x20" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:impl="0x1FFFF" edc:_addr="0x40038000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="UADD" edc:nzwidth="0x7" edc:desc="USB Address"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1" edc:desc="Address Enable"/>
            <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1" edc:desc="Detach"/>
            <edc:SFRFieldDef edc:cname="RMWKUP" edc:nzwidth="0x1" edc:desc="Remote Wake-Up"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:nzwidth="0x2" edc:desc="Mode Configuration">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="Forced high speed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FORCED_FS" edc:desc="The peripheral remains in Full-speed mode whatever the host speed capability." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LS" edc:nzwidth="0x1" edc:desc="Low-Speed Mode Force"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:nzwidth="0x1" edc:desc="Test mode J"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:nzwidth="0x1" edc:desc="Test mode K"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:nzwidth="0x1" edc:desc="Test packet mode"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:nzwidth="0x1" edc:desc="Specific Operational mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVISR" edc:nzwidth="0x20" edc:access="rrrrrrr---rrrrrrrrrr-----rrrrrrr" edc:impl="0xFE3FF07F" edc:_addr="0x40038004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspend Interrupt"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 7 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVICR" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40038008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPC" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MSOFC" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SOFC" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="EORSTC" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="WAKEUPC" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="EORSMC" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UPRSMC" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
