Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVIFR" edc:nzwidth="0x20" edc:access="wwwwwww------------------wwwwwww" edc:impl="0xFE00007F" edc:_addr="0x4003800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPS" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="MSOFS" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SOFS" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="EORSTS" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="WAKEUPS" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="EORSMS" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UPRSMS" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 7 Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVIMR" edc:nzwidth="0x20" edc:access="rrrrrrr---rrrrrrrrrr-----rrrrrrr" edc:impl="0xFE3FF07F" edc:_addr="0x40038010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPE" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MSOFE" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="EORSTE" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="WAKEUPE" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="EORSME" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UPRSME" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 7 Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVIDR" edc:nzwidth="0x20" edc:access="wwwwwww---wwwwwwwwww-----wwwwwww" edc:impl="0xFE3FF07F" edc:_addr="0x40038014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPEC" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MSOFEC" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SOFEC" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="EORSTEC" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPEC" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="EORSMEC" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UPRSMEC" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 7 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
