Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVIER" edc:nzwidth="0x20" edc:access="wwwwwww---wwwwwwwwww-----wwwwwww" edc:impl="0xFE3FF07F" edc:_addr="0x40038018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPES" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MSOFES" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SOFES" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORSTES" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUPES" edc:nzwidth="0x1" edc:desc="Wake-Up Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORSMES" edc:nzwidth="0x1" edc:desc="End of Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UPRSMES" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 7 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPT" edc:nzwidth="0x20" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:impl="0x3FF03FF" edc:_addr="0x4003801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="EPEN0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Enable"/>
            <edc:SFRFieldDef edc:cname="EPEN9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EPRST0" edc:nzwidth="0x1" edc:desc="Endpoint 0 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST1" edc:nzwidth="0x1" edc:desc="Endpoint 1 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST2" edc:nzwidth="0x1" edc:desc="Endpoint 2 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST3" edc:nzwidth="0x1" edc:desc="Endpoint 3 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST4" edc:nzwidth="0x1" edc:desc="Endpoint 4 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST5" edc:nzwidth="0x1" edc:desc="Endpoint 5 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST6" edc:nzwidth="0x1" edc:desc="Endpoint 6 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST7" edc:nzwidth="0x1" edc:desc="Endpoint 7 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST8" edc:nzwidth="0x1" edc:desc="Endpoint 8 Reset"/>
            <edc:SFRFieldDef edc:cname="EPRST9" edc:nzwidth="0x1" edc:desc="Endpoint 9 Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVFNUM" edc:nzwidth="0x20" edc:access="----------------r-rrrrrrrrrrrrrr" edc:impl="0xBFFF" edc:_addr="0x40038020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:nzwidth="0x3" edc:desc="Micro Frame Number"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:nzwidth="0xB" edc:desc="Frame Number"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FNCERR" edc:nzwidth="0x1" edc:desc="Frame Number CRC Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xDC" edc:_addr="0x40038024"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTCFG0" edc:nzwidth="0x20" edc:access="-----------------nnnn-nn-nnnnnn-" edc:impl="0x7B7E" edc:_addr="0x40038100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Endpoint Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2" edc:desc="Endpoint Banks">
              <edc:SFRFieldSemantic edc:cname="1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3" edc:desc="Endpoint Size">
              <edc:SFRFieldSemantic edc:cname="8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1" edc:desc="Endpoint Direction">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2" edc:desc="Endpoint Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:nzwidth="0x2" edc:desc="Number of transactions per microframe for isochronous endpoint">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTCFG1" edc:nzwidth="0x20" edc:access="-----------------nnnn-nn-nnnnnn-" edc:impl="0x7B7E" edc:_addr="0x40038104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Endpoint Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2" edc:desc="Endpoint Banks">
              <edc:SFRFieldSemantic edc:cname="1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3" edc:desc="Endpoint Size">
              <edc:SFRFieldSemantic edc:cname="8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1" edc:desc="Endpoint Direction">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2" edc:desc="Endpoint Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:nzwidth="0x2" edc:desc="Number of transactions per microframe for isochronous endpoint">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
