Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR3" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x4003813C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR4" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR5" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR6" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038148">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR7" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x4003814C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR8" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
