Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR3" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4003816C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR4" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038170">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR5" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038174">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR6" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038178">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR7" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4003817C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR8" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTICR9" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038188"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR0" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR1" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
