Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400381E8"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER0" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x400381F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER1" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x400381F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER2" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x400381F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER3" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x400381FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER4" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x40038200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
