Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR4" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR5" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038234">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR6" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR7" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x4003823C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
