Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038528"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR0" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR1" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038534">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR2" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038538">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR3" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x4003853C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR4" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038540">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR5" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038544">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR6" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038548">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
