Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER3" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x400385FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER4" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x40038600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER5" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x40038604">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER6" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x40038608">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER7" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x4003860C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER8" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x40038610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER9" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x40038614">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038618"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR0" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR1" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038624">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR2" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038628">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR3" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x4003862C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR4" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR5" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038634">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
