Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ8" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ9" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038674">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038678"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR0" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR1" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038684">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR2" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038688">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR3" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x4003868C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR4" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038690">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR5" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038694">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR6" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40038698">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR7" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x4003869C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR8" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x400386A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPERR9" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x400386A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1" edc:desc="Data Toggle Error"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1" edc:desc="Data PID Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Time-Out Error"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1" edc:desc="CRC16 Error"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2" edc:desc="Error Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x68" edc:_addr="0x400386A8"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA0USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038710">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
