Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA5USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038764">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA5USBHS_HSTDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038768">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA5USBHS_HSTDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003876C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA6USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038770">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA6USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038774">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA6USBHS_HSTDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038778">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA6USBHS_HSTDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003877C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x40038780"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_CTRL" edc:nzwidth="0x20" edc:access="------nn--------nn-----n---n----" edc:impl="0x300C110" edc:_addr="0x40038800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRE" edc:nzwidth="0x1" edc:desc="Remote Device Connection Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VBUSHWC" edc:nzwidth="0x1" edc:desc="VBUS Hardware Control"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FRZCLK" edc:nzwidth="0x1" edc:desc="Freeze USB Clock"/>
            <edc:SFRFieldDef edc:cname="USBE" edc:nzwidth="0x1" edc:desc="USBHS Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="UID" edc:nzwidth="0x1" edc:desc="UID Pin Enable"/>
            <edc:SFRFieldDef edc:cname="UIMOD" edc:nzwidth="0x1" edc:desc="USBHS Mode">
              <edc:SFRFieldSemantic edc:cname="HOST" edc:desc="The module is in USB Host mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DEVICE" edc:desc="The module is in USB Device mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_SR" edc:nzwidth="0x20" edc:access="-----------------rrr-------r----" edc:impl="0x7010" edc:_addr="0x40038804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRI" edc:nzwidth="0x1" edc:desc="Remote Device Connection Error Interrupt (Host mode only)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Status (Device mode only)">
              <edc:SFRFieldSemantic edc:cname="FULL_SPEED" edc:desc="Full-Speed mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="High-Speed mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOW_SPEED" edc:desc="Low-Speed mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKUSABLE" edc:nzwidth="0x1" edc:desc="UTMI Clock Usable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
