Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_IMR" edc:nzwidth="0x20" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:impl="0x47000FFF" edc:_addr="0x4003C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 11"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_ISR" edc:nzwidth="0x20" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:impl="0x47000FFF" edc:_addr="0x4003C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion 0 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion 1 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion 2 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion 3 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion 4 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion 5 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion 6 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion 7 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion 8 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion 9 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion 10 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion 11 (cleared by reading AFEC_CDRx)"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared by reading AFEC_LCDR)"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error (cleared by reading AFEC_ISR)"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Error (cleared by reading AFEC_ISR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x4003C034"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_OVER" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:impl="0xFFF" edc:_addr="0x4003C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:nzwidth="0x1" edc:desc="Overrun Error 0"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:nzwidth="0x1" edc:desc="Overrun Error 1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:nzwidth="0x1" edc:desc="Overrun Error 2"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:nzwidth="0x1" edc:desc="Overrun Error 3"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:nzwidth="0x1" edc:desc="Overrun Error 4"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:nzwidth="0x1" edc:desc="Overrun Error 5"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:nzwidth="0x1" edc:desc="Overrun Error 6"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:nzwidth="0x1" edc:desc="Overrun Error 7"/>
            <edc:SFRFieldDef edc:cname="OVRE8" edc:nzwidth="0x1" edc:desc="Overrun Error 8"/>
            <edc:SFRFieldDef edc:cname="OVRE9" edc:nzwidth="0x1" edc:desc="Overrun Error 9"/>
            <edc:SFRFieldDef edc:cname="OVRE10" edc:nzwidth="0x1" edc:desc="Overrun Error 10"/>
            <edc:SFRFieldDef edc:cname="OVRE11" edc:nzwidth="0x1" edc:desc="Overrun Error 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
