Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0x10" edc:desc="Low Threshold"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0x10" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CGR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4003C054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="GAIN0" edc:nzwidth="0x2" edc:desc="Gain for Channel 0"/>
            <edc:SFRFieldDef edc:cname="GAIN1" edc:nzwidth="0x2" edc:desc="Gain for Channel 1"/>
            <edc:SFRFieldDef edc:cname="GAIN2" edc:nzwidth="0x2" edc:desc="Gain for Channel 2"/>
            <edc:SFRFieldDef edc:cname="GAIN3" edc:nzwidth="0x2" edc:desc="Gain for Channel 3"/>
            <edc:SFRFieldDef edc:cname="GAIN4" edc:nzwidth="0x2" edc:desc="Gain for Channel 4"/>
            <edc:SFRFieldDef edc:cname="GAIN5" edc:nzwidth="0x2" edc:desc="Gain for Channel 5"/>
            <edc:SFRFieldDef edc:cname="GAIN6" edc:nzwidth="0x2" edc:desc="Gain for Channel 6"/>
            <edc:SFRFieldDef edc:cname="GAIN7" edc:nzwidth="0x2" edc:desc="Gain for Channel 7"/>
            <edc:SFRFieldDef edc:cname="GAIN8" edc:nzwidth="0x2" edc:desc="Gain for Channel 8"/>
            <edc:SFRFieldDef edc:cname="GAIN9" edc:nzwidth="0x2" edc:desc="Gain for Channel 9"/>
            <edc:SFRFieldDef edc:cname="GAIN10" edc:nzwidth="0x2" edc:desc="Gain for Channel 10"/>
            <edc:SFRFieldDef edc:cname="GAIN11" edc:nzwidth="0x2" edc:desc="Gain for Channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4003C058"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_DIFFR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x4003C060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DIFF0" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 0"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 2"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 3"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 4"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 5"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 6"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 7"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 8"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 9"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 10"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CSELR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x4003C064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:nzwidth="0x4" edc:desc="Channel Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CDR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4003C068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_COCR" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x4003C06C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="AOFF" edc:nzwidth="0xA" edc:desc="Analog Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_TEMPMR" edc:nzwidth="0x20" edc:access="--------------------------nn---n" edc:impl="0x31" edc:_addr="0x4003C070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="RTCT" edc:nzwidth="0x1" edc:desc="Temperature Sensor RTC Trigger Mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:nzwidth="0x2" edc:desc="Temperature Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_TEMPCWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:nzwidth="0x10" edc:desc="Temperature Low Threshold"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:nzwidth="0x10" edc:desc="Temperature High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x4003C078"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_ACR" edc:nzwidth="0x20" edc:access="----------------------nn----nn--" edc:impl="0x30C" edc:_addr="0x4003C094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:nzwidth="0x1" edc:desc="PGA0 Enable"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:nzwidth="0x1" edc:desc="PGA1 Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:nzwidth="0x2" edc:desc="AFE Bias Current Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4003C098"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_SHMR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x4003C0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 0"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 2"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 3"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 4"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 5"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 6"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 7"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 8"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 9"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 10"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2C" edc:_addr="0x4003C0A4"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_COSR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4003C0D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:nzwidth="0x1" edc:desc="Sample &amp; Hold unit Correction Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
