Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C0D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x10" edc:desc="Offset Correction"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x10" edc:desc="Gain Correction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_CECR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x4003C0D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 3"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 4"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 5"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 6"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 7"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 8"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 9"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 10"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4003C0DC"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x4003C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protect KEY">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC0" edc:cname="AFEC0_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x4003C0E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x4003C0EC"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40040000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_MR" edc:nzwidth="0x20" edc:access="----nnnnn-----------------nn--nn" edc:impl="0xF800033" edc:_addr="0x40040004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="MAXS0" edc:nzwidth="0x1" edc:desc="Max Speed Mode for Channel 0">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXS1" edc:nzwidth="0x1" edc:desc="Max Speed Mode for Channel 1">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WORD" edc:nzwidth="0x1" edc:desc="Word Transfer Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="One data to convert is written to the FIFO per access to DACC." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Must always be written to 0."/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x1" edc:desc="Differential Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="DAC0 and DAC1 are single-ended outputs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="DACP and DACN are differential outputs. The differential level is configured by the channel 0 value." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x4" edc:desc="Peripheral Clock to DAC Clock Ratio"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_TRIGR" edc:nzwidth="0x20" edc:access="---------nnn-nnn-----nnn-nnn--nn" edc:impl="0x770773" edc:_addr="0x40040008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TRGEN0" edc:nzwidth="0x1" edc:desc="Trigger Enable of Channel 0">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGEN1" edc:nzwidth="0x1" edc:desc="Trigger Enable of Channel 1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL0" edc:nzwidth="0x3" edc:desc="Trigger Selection of Channel 0">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DAC External Trigger Input (DATRG)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 Channel 0 Output (TIOA0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC0 Channel 1 Output (TIOA1)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC0 Channel 2 Output (TIOA2)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 Event Line 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 Event Line 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 Event Line 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 Event Line 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSEL1" edc:nzwidth="0x3" edc:desc="Trigger Selection of Channel 1">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DAC External Trigger Input (DATRG)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 Channel 0 Output (TIOA0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC0 Channel 1 Output (TIOA1)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC0 Channel 2 Output (TIOA2)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 Event Line 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 Event Line 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 Event Line 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 Event Line 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSR0" edc:nzwidth="0x3" edc:desc="Over Sampling Ratio of Channel 0">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR1" edc:nzwidth="0x3" edc:desc="Over Sampling Ratio of Channel 1">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4004000C"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40040010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
