Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHDR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40040014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Disable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHSR" edc:nzwidth="0x20" edc:access="----------------------rr------rr" edc:impl="0x303" edc:_addr="0x40040018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DACRDY0" edc:nzwidth="0x1" edc:desc="DAC Ready Flag"/>
            <edc:SFRFieldDef edc:cname="DACRDY1" edc:nzwidth="0x1" edc:desc="DAC Ready Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CDR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4004001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="DATA0" edc:nzwidth="0x10" edc:desc="Data to Convert for channel 0"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:nzwidth="0x10" edc:desc="Data to Convert for channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CDR1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40040020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="DATA0" edc:nzwidth="0x10" edc:desc="Data to Convert for channel 0"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:nzwidth="0x10" edc:desc="Data to Convert for channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_IER" edc:nzwidth="0x20" edc:access="--------------------------ww--ww" edc:impl="0x33" edc:_addr="0x40040024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Enable of channel 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Enable of channel 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable of channel 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable of channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_IDR" edc:nzwidth="0x20" edc:access="--------------------------ww--ww" edc:impl="0x33" edc:_addr="0x40040028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable of channel 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable of channel 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable of channel 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable of channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_IMR" edc:nzwidth="0x20" edc:access="--------------------------rr--rr" edc:impl="0x33" edc:_addr="0x4004002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Mask of channel 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Mask of channel 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask of channel 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask of channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_ISR" edc:nzwidth="0x20" edc:access="--------------------------rr--rr" edc:impl="0x33" edc:_addr="0x40040030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Flag of channel 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Flag of channel 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Flag of channel 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Flag of channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x40040034"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_ACR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40040094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="IBCTLCH0" edc:nzwidth="0x2" edc:desc="Analog Output Current Control"/>
            <edc:SFRFieldDef edc:cname="IBCTLCH1" edc:nzwidth="0x2" edc:desc="Analog Output Current Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4C" edc:_addr="0x40040098"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400400E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protect Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x444143"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
