Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_WPSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0x400400E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x8" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400400EC"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_CR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40044000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_MR" edc:nzwidth="0x20" edc:access="-----------------nnn-nnn-nnn-nnn" edc:impl="0x7777" edc:_addr="0x40044004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="SELMINUS" edc:nzwidth="0x3" edc:desc="Selection for Minus Comparator Input">
              <edc:SFRFieldSemantic edc:cname="TS" edc:desc="Select TS" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="Select VREFP" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="Select DAC0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DAC1" edc:desc="Select DAC1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELPLUS" edc:nzwidth="0x3" edc:desc="Selection For Plus Comparator Input">
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD4" edc:desc="Select AFE0_AD4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD5" edc:desc="Select AFE0_AD5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD0" edc:desc="Select AFE1_AD0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD1" edc:desc="Select AFE1_AD1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:nzwidth="0x1" edc:desc="Analog Comparator Enable">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGETYP" edc:nzwidth="0x2" edc:desc="Edge Type">
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Only rising edge of comparator output" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of comparator output" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ANY" edc:desc="Any edge of comparator output" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INV" edc:nzwidth="0x1" edc:desc="Invert Comparator Output">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator output is directly processed." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator output is inverted prior to being processed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELFS" edc:nzwidth="0x1" edc:desc="Selection Of Fault Source">
              <edc:SFRFieldSemantic edc:cname="CE" edc:desc="The CE flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTPUT" edc:desc="The output of the analog comparator flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Fault Enable">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The FAULT output is tied to 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The FAULT output is driven by the signal defined by SELFS." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x40044008"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_IER" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40044024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40044028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4004402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_ISR" edc:nzwidth="0x20" edc:access="r-----------------------------rr" edc:impl="0x80000003" edc:_addr="0x40044030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Comparison Edge (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCO" edc:nzwidth="0x1" edc:desc="Synchronized Comparator Output"/>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x1" edc:desc="Flag Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x40044034"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_ACR" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x40044094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="ISEL" edc:nzwidth="0x1" edc:desc="Current Selection">
              <edc:SFRFieldSemantic edc:cname="LOPW" edc:desc="Low-power option." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HISP" edc:desc="High-speed option." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x2" edc:desc="Hysteresis Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4C" edc:_addr="0x40044098"/>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400440E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ACC" edc:cname="ACC_WPSR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400440E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ACC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400440EC"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_CFG" edc:nzwidth="0x20" edc:access="----------------nnnn--nnnnnn-nnn" edc:impl="0xF3F7" edc:_addr="0x40048000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="WBDIS" edc:nzwidth="0x1" edc:desc="Write Back Disable"/>
            <edc:SFRFieldDef edc:cname="EOMDIS" edc:nzwidth="0x1" edc:desc="End of Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="SLBDIS" edc:nzwidth="0x1" edc:desc="Secondary List Branching Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BBC" edc:nzwidth="0x4" edc:desc="Bus Burden Control"/>
            <edc:SFRFieldDef edc:cname="ASCD" edc:nzwidth="0x1" edc:desc="Automatic Switch To Compare Digest"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UIHASH" edc:nzwidth="0x1" edc:desc="User Initial Hash Value"/>
            <edc:SFRFieldDef edc:cname="UALGO" edc:nzwidth="0x3" edc:desc="User SHA Algorithm">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 algorithm processed" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 algorithm processed" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 algorithm processed" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_CTRL" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwww-www" edc:impl="0xFFF7" edc:_addr="0x40048004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ICM Enable"/>
            <edc:SFRFieldDef edc:cname="DISABLE" edc:nzwidth="0x1" edc:desc="ICM Disable Register"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REHASH" edc:nzwidth="0x4" edc:desc="Recompute Internal Hash"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="RMEN" edc:nzwidth="0x4" edc:desc="Region Monitoring Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
