Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4005C0B4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FPV2" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x4005C0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPZH0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZH1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZH2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZH3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPZL0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZL1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZL2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZL3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x4005C0C4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_WPCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4005C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WPCMD" edc:nzwidth="0x2" edc:desc="Write Protection Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE_SW_PROT" edc:desc="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_SW_PROT" edc:desc="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_HW_PROT" edc:desc="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WPRG0" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 0"/>
            <edc:SFRFieldDef edc:cname="WPRG1" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 1"/>
            <edc:SFRFieldDef edc:cname="WPRG2" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 2"/>
            <edc:SFRFieldDef edc:cname="WPRG3" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 3"/>
            <edc:SFRFieldDef edc:cname="WPRG4" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 4"/>
            <edc:SFRFieldDef edc:cname="WPRG5" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x50574D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr--rrrrrrr-rrrrrr" edc:impl="0xFFFF3FBF" edc:_addr="0x4005C0E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WPSWS0" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS1" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS2" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS3" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS4" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS5" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS0" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS1" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS2" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS3" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS4" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS5" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x44" edc:_addr="0x4005C0EC"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP0PWM1_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4005C130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP0PWM1_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4005C134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP0PWM1_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4005C138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP0PWM1_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4005C13C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
