Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400640DC"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400640E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protect KEY">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400640E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400640EC"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MLBC0" edc:nzwidth="0x20" edc:access="--------------nnnn-n----n-nnnn-n" edc:impl="0x3D0BD" edc:_addr="0x40068000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MLBEN" edc:nzwidth="0x1" edc:desc="MediaLB Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLBCLK" edc:nzwidth="0x3" edc:desc="MLBCLK (MediaLB clock) Speed Select">
              <edc:SFRFieldSemantic edc:cname="_256_FS" edc:desc="256xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_512_FS" edc:desc="512xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_1024_FS" edc:desc="1024xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Must be Written to 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLBLK" edc:nzwidth="0x1" edc:desc="MediaLB Lock Status (read-only)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ASYRETRY" edc:nzwidth="0x1" edc:desc="Asynchronous Tx Packet Retry"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTLRETRY" edc:nzwidth="0x1" edc:desc="Control Tx Packet Retry"/>
            <edc:SFRFieldDef edc:cname="FCNT" edc:nzwidth="0x3" edc:desc="The number of frames per sub-buffer for synchronous channels">
              <edc:SFRFieldSemantic edc:cname="_1_FRAME" edc:desc="1 frame per sub-buffer (Operation is the same as Standard mode.)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_FRAMES" edc:desc="2 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_FRAMES" edc:desc="4 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_FRAMES" edc:desc="8 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_FRAMES" edc:desc="16 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_FRAMES" edc:desc="32 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_64_FRAMES" edc:desc="64 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40068004"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MS0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MCS" edc:nzwidth="0x20" edc:desc="MediaLB Channel Status [31:0] (cleared by writing a 0)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40068010"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MS1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40068014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MCS" edc:nzwidth="0x20" edc:desc="MediaLB Channel Status [63:32] (cleared by writing a 0)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40068018"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MSS" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x40068020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="RSTSYSCMD" edc:nzwidth="0x1" edc:desc="Reset System Command Detected in the System Quadlet (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="LKSYSCMD" edc:nzwidth="0x1" edc:desc="Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="ULKSYSCMD" edc:nzwidth="0x1" edc:desc="Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="CSSYSCMD" edc:nzwidth="0x1" edc:desc="Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="SWSYSCMD" edc:nzwidth="0x1" edc:desc="Software System Command Detected in the System Quadlet (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="SERVREQ" edc:nzwidth="0x1" edc:desc="Service Request Enabled"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
