Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MSD" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40068024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="SD0" edc:nzwidth="0x8" edc:desc="System Data (Byte 0)"/>
            <edc:SFRFieldDef edc:cname="SD1" edc:nzwidth="0x8" edc:desc="System Data (Byte 1)"/>
            <edc:SFRFieldDef edc:cname="SD2" edc:nzwidth="0x8" edc:desc="System Data (Byte 2)"/>
            <edc:SFRFieldDef edc:cname="SD3" edc:nzwidth="0x8" edc:desc="System Data (Byte 3)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40068028"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MIEN" edc:nzwidth="0x20" edc:access="--nnnnnn-nnnnnnn--------------nn" edc:impl="0x3F7F0003" edc:_addr="0x4006802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="ISOC_PE" edc:nzwidth="0x1" edc:desc="Isochronous Rx Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="ISOC_BUFO" edc:nzwidth="0x1" edc:desc="Isochronous Rx Buffer Overflow Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="SYNC_PE" edc:nzwidth="0x1" edc:desc="Synchronous Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="ARX_DONE" edc:nzwidth="0x1" edc:desc="Asynchronous Rx Done Enable"/>
            <edc:SFRFieldDef edc:cname="ARX_PE" edc:nzwidth="0x1" edc:desc="Asynchronous Rx Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="ARX_BREAK" edc:nzwidth="0x1" edc:desc="Asynchronous Rx Break Enable"/>
            <edc:SFRFieldDef edc:cname="ATX_DONE" edc:nzwidth="0x1" edc:desc="Asynchronous Tx Packet Done Enable"/>
            <edc:SFRFieldDef edc:cname="ATX_PE" edc:nzwidth="0x1" edc:desc="Asynchronous Tx Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="ATX_BREAK" edc:nzwidth="0x1" edc:desc="Asynchronous Tx Break Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRX_DONE" edc:nzwidth="0x1" edc:desc="Control Rx Packet Done Enable"/>
            <edc:SFRFieldDef edc:cname="CRX_PE" edc:nzwidth="0x1" edc:desc="Control Rx Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="CRX_BREAK" edc:nzwidth="0x1" edc:desc="Control Rx Break Enable"/>
            <edc:SFRFieldDef edc:cname="CTX_DONE" edc:nzwidth="0x1" edc:desc="Control Tx Packet Done Enable"/>
            <edc:SFRFieldDef edc:cname="CTX_PE" edc:nzwidth="0x1" edc:desc="Control Tx Protocol Error Enable"/>
            <edc:SFRFieldDef edc:cname="CTX_BREAK" edc:nzwidth="0x1" edc:desc="Control Tx Break Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40068030"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MLBC1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnn------" edc:impl="0xFFC0" edc:_addr="0x4006803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="MediaLB Lock Error Status (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="CLKM" edc:nzwidth="0x1" edc:desc="MediaLB Clock Missing Status (cleared by writing a 0)"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:nzwidth="0x8" edc:desc="Node Device Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x40" edc:_addr="0x40068040"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCTL" edc:nzwidth="0x20" edc:access="----------------n-------------nn" edc:impl="0x8003" edc:_addr="0x40068080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="RST0" edc:nzwidth="0x1" edc:desc="Address Generation Unit 0 Software Reset"/>
            <edc:SFRFieldDef edc:cname="RST1" edc:nzwidth="0x1" edc:desc="Address Generation Unit 1 Software Reset"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="HBI Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40068084"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCMR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40068088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:nzwidth="0x20" edc:desc="Bitwise Channel Mask Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCMR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006808C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:nzwidth="0x20" edc:desc="Bitwise Channel Mask Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCER0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40068090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CERR" edc:nzwidth="0x20" edc:desc="Bitwise Channel Error Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCER1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40068094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CERR" edc:nzwidth="0x20" edc:desc="Bitwise Channel Error Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
