Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCBR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40068098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHB" edc:nzwidth="0x20" edc:desc="Bitwise Channel Busy Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_HCBR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4006809C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHB" edc:nzwidth="0x20" edc:desc="Bitwise Channel Busy Bit [31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x400680A0"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDAT0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="CRT or DBR Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDAT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="CRT or DBR Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDAT2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="CRT or DBR Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDAT3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="CRT or DBR Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDWE0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x20" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDWE1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x20" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDWE2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x20" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MDWE3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400680DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x20" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MCTL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x400680E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="XCMP" edc:nzwidth="0x1" edc:desc="Transfer Complete (Write 0 to Clear)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_MADR" edc:nzwidth="0x20" edc:access="nn----------------nnnnnnnnnnnnnn" edc:impl="0xC0003FFF" edc:_addr="0x400680E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0xE" edc:desc="CTR or DBR Address"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="TB" edc:nzwidth="0x1" edc:desc="Target Location Bit">
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="Selects CTR" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBR" edc:desc="Selects DBR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WNR" edc:nzwidth="0x1" edc:desc="Write-Not-Read Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2D8" edc:_addr="0x400680E8"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_ACTL" edc:nzwidth="0x20" edc:access="---------------------------n-nnn" edc:impl="0x17" edc:_addr="0x400683C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="SCE" edc:nzwidth="0x1" edc:desc="Software Clear Enable"/>
            <edc:SFRFieldDef edc:cname="SMX" edc:nzwidth="0x1" edc:desc="AHB Interrupt Mux Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_MODE" edc:nzwidth="0x1" edc:desc="DMA Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MPB" edc:nzwidth="0x1" edc:desc="DMA Packet Buffering Mode">
              <edc:SFRFieldSemantic edc:cname="SINGLE_PACKET" edc:desc="Single-packet mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE_PACKET" edc:desc="Multiple-packet mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
