Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400683C4"/>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_ACSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400683D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHS" edc:nzwidth="0x20" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_ACSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400683D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHS" edc:nzwidth="0x20" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_ACMR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400683D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:nzwidth="0x20" edc:desc="Bitwise Channel Mask Bits 31 to 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MLB" edc:cname="MLB_ACMR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400683DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:nzwidth="0x20" edc:desc="Bitwise Channel Mask Bits 31 to 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C20" edc:_addr="0x400683E0"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_CR" edc:nzwidth="0x20" edc:access="---------------w-------w-------w" edc:impl="0x10101" edc:_addr="0x4006C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Processing"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="LOADSEED" edc:nzwidth="0x1" edc:desc="Random Number Generator Seed Loading"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_MR" edc:nzwidth="0x20" edc:access="--------nnnn-nnnnnnnnnnnnnnnn-nn" edc:impl="0xF7FFFB" edc:_addr="0x4006C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CIPHER" edc:nzwidth="0x1" edc:desc="Processing Mode"/>
            <edc:SFRFieldDef edc:cname="GTAGEN" edc:nzwidth="0x1" edc:desc="GCM Automatic Tag Generation Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="AES_IDATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCDLY" edc:nzwidth="0x4" edc:desc="Processing Delay"/>
            <edc:SFRFieldDef edc:cname="SMOD" edc:nzwidth="0x2" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="AES_IDATAR0 access only Auto Mode (DMA)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:nzwidth="0x2" edc:desc="Key Size">
              <edc:SFRFieldSemantic edc:cname="AES128" edc:desc="AES Key Size is 128 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AES192" edc:desc="AES Key Size is 192 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AES256" edc:desc="AES Key Size is 256 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="ECB" edc:desc="ECB: Electronic Code Book mode" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CBC" edc:desc="CBC: Cipher Block Chaining mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFB" edc:desc="OFB: Output Feedback mode" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CFB" edc:desc="CFB: Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="CTR: Counter mode (16-bit internal counter)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCM" edc:desc="GCM: Galois/Counter mode" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOD" edc:nzwidth="0x1" edc:desc="Last Output Data Mode"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:nzwidth="0x3" edc:desc="Cipher Feedback Data Size">
              <edc:SFRFieldSemantic edc:cname="SIZE_128BIT" edc:desc="128-bit" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_64BIT" edc:desc="64-bit" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_32BIT" edc:desc="32-bit" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_16BIT" edc:desc="16-bit" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_8BIT" edc:desc="8-bit" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEY" edc:nzwidth="0x4" edc:desc="Countermeasure Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0." edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4006C008"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_IER" edc:nzwidth="0x20" edc:access="---------------w-------w-------w" edc:impl="0x10101" edc:_addr="0x4006C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:nzwidth="0x1" edc:desc="GCM Tag Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
