Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_GCMHR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006C0A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="H" edc:nzwidth="0x20" edc:desc="GCM H Word x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_GCMHR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006C0A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="H" edc:nzwidth="0x20" edc:desc="GCM H Word x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F54" edc:_addr="0x4006C0AC"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_CR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww-------w" edc:impl="0xFFFFFF01" edc:_addr="0x40070000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enables the TRNG to Provide Random Values"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x18" edc:desc="Security Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFFFFFF) == 0x524E47"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40070004"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_IER" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40070010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40070014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40070018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4007001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x40070020"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_ODATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40070050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7FAC" edc:_addr="0x40070054"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GTYPE" edc:nzwidth="0x20" edc:access="---------rrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x7FFFFF" edc:_addr="0x40078000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NB_CH" edc:nzwidth="0x5" edc:desc="Number of Channels Minus One"/>
            <edc:SFRFieldDef edc:cname="FIFO_SZ" edc:nzwidth="0xB" edc:desc="Number of Bytes"/>
            <edc:SFRFieldDef edc:cname="NB_REQ" edc:nzwidth="0x7" edc:desc="Number of Peripheral Requests Minus One"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GCFG" edc:nzwidth="0x20" edc:access="-----------------------n----nnnn" edc:impl="0x10F" edc:_addr="0x40078004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="CGDISREG" edc:nzwidth="0x1" edc:desc="Configuration Registers Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISPIPE" edc:nzwidth="0x1" edc:desc="Pipeline Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISFIFO" edc:nzwidth="0x1" edc:desc="FIFO Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISIF" edc:nzwidth="0x1" edc:desc="Bus Interface Clock Gating Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="BXKBEN" edc:nzwidth="0x1" edc:desc="Boundary X Kilobyte Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GWAC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40078008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="PW0" edc:nzwidth="0x4" edc:desc="Pool Weight 0"/>
            <edc:SFRFieldDef edc:cname="PW1" edc:nzwidth="0x4" edc:desc="Pool Weight 1"/>
            <edc:SFRFieldDef edc:cname="PW2" edc:nzwidth="0x4" edc:desc="Pool Weight 2"/>
            <edc:SFRFieldDef edc:cname="PW3" edc:nzwidth="0x4" edc:desc="Pool Weight 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
