Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIE" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4007800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IE0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GID" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ID0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIM" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40078014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IM0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Mask Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIS" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40078018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
