Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWR" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWREQ0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Request Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWS" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x4007803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWRS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Request Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
