Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID23XDMAC_CSUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078640">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:nzwidth="0x18" edc:desc="Channel x Source Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID23XDMAC_CDUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078644">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:nzwidth="0x18" edc:desc="Channel x Destination Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x39B8" edc:_addr="0x40078648"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_CR" edc:nzwidth="0x20" edc:access="-------w----------------w-----ww" edc:impl="0x1000083" edc:_addr="0x4007C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="QSPIEN" edc:nzwidth="0x1" edc:desc="QSPI Enable"/>
            <edc:SFRFieldDef edc:cname="QSPIDIS" edc:nzwidth="0x1" edc:desc="QSPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="QSPI Software Reset"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnn--nn-nnn" edc:impl="0xFFFF0F37" edc:_addr="0x4007C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SMM" edc:nzwidth="0x1" edc:desc="Serial Memory Mode">
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="The QSPI is in SPI mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEMORY" edc:desc="The QSPI is in Serial Memory mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LLB" edc:nzwidth="0x1" edc:desc="Local Loopback Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Local loopback path disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Local loopback path enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CSMODE" edc:nzwidth="0x2" edc:desc="Chip Select Mode">
              <edc:SFRFieldSemantic edc:cname="NOT_RELOADED" edc:desc="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LASTXFER" edc:desc="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SYSTEMATICALLY" edc:desc="The chip select is deasserted systematically after each transfer." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBBITS" edc:nzwidth="0x4" edc:desc="Number Of Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
            <edc:SFRFieldDef edc:cname="DLYCS" edc:nzwidth="0x8" edc:desc="Minimum Inactive QCS Delay"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RDR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4007C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x10" edc:desc="Receive Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4007C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TD" edc:nzwidth="0x10" edc:desc="Transmit Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_SR" edc:nzwidth="0x20" edc:access="-------r-------------rrr----rrrr" edc:impl="0x100070F" edc:_addr="0x4007C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full (cleared by reading SPI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Chip Select Rise (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x1" edc:desc="Chip Select Status"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:nzwidth="0x1" edc:desc="Instruction End Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="QSPIENS" edc:nzwidth="0x1" edc:desc="QSPI Enable Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
