Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR3MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x4008809C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR4MATRIX_PRAS" edc:nzwidth="0x20" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:impl="0x33333333" edc:_addr="0x400880A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR4MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400880A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR5MATRIX_PRAS" edc:nzwidth="0x20" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:impl="0x33333333" edc:_addr="0x400880A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR5MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400880AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR6MATRIX_PRAS" edc:nzwidth="0x20" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:impl="0x33333333" edc:_addr="0x400880B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR6MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400880B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR7MATRIX_PRAS" edc:nzwidth="0x20" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:impl="0x33333333" edc:_addr="0x400880B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR7MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400880BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR8MATRIX_PRAS" edc:nzwidth="0x20" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:impl="0x33333333" edc:_addr="0x400880C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
