Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_PR8MATRIX_PRBS" edc:nzwidth="0x20" edc:access="--------------nn------nn------nn" edc:impl="0x30303" edc:_addr="0x400880C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x400880C8"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_MRCR" edc:nzwidth="0x20" edc:access="-------------------n-n-nnnnnnnnn" edc:impl="0x15FF" edc:_addr="0x40088100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40088104"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_CAN0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:impl="0xFFFF0000" edc:_addr="0x40088110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CAN0DMABA" edc:nzwidth="0x10" edc:desc="CAN0 DMA Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_SYSIO" edc:nzwidth="0x20" edc:access="-------------------n----nnnn----" edc:impl="0x10F0" edc:_addr="0x40088114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:nzwidth="0x1" edc:desc="PB4 or TDI Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:nzwidth="0x1" edc:desc="PB5 or TDO/TRACESWO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:nzwidth="0x1" edc:desc="PB6 or TMS/SWDIO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:nzwidth="0x1" edc:desc="PB7 or TCK/SWCLK Assignment"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:nzwidth="0x1" edc:desc="PB12 or ERASE Assignment"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_PCCR" edc:nzwidth="0x20" edc:access="---------nnn--------------------" edc:impl="0x700000" edc:_addr="0x40088118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="TC0CC" edc:nzwidth="0x1" edc:desc="TC0 Clock Configuration"/>
            <edc:SFRFieldDef edc:cname="I2SC0CC" edc:nzwidth="0x1" edc:desc="I2SC0 Clock Configuration"/>
            <edc:SFRFieldDef edc:cname="I2SC1CC" edc:nzwidth="0x1" edc:desc="I2SC1 Clock Configuration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_DYNCKG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x4008811C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:nzwidth="0x1" edc:desc="MATRIX Dynamic Clock Gating"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:nzwidth="0x1" edc:desc="Bridge Dynamic Clock Gating Enable"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:nzwidth="0x1" edc:desc="EFC Dynamic Clock Gating Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40088120"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_SMCNFCS" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40088124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SMC_NFCS0" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 0 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS1" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 1 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS2" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 2 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS3" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 3 Assignment"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
