Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IDR" edc:nzwidth="0x20" edc:access="----------w--wwwwwwwwwww-w--w-ww" edc:impl="0x27FF4B" edc:_addr="0x400E0664">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:nzwidth="0x1" edc:desc="UTMI PLL Lock Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 4 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 5 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 6 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 7 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SR" edc:nzwidth="0x20" edc:access="----------rrrrrrrrrrrrrrrr--r-rr" edc:impl="0x3FFFCB" edc:_addr="0x400E0668">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:nzwidth="0x1" edc:desc="UTMI PLL Lock Status"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:nzwidth="0x1" edc:desc="Slow Clock Source Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 4 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 5 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 6 Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 7 Status"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Status"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Fault Output Status"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IMR" edc:nzwidth="0x20" edc:access="----------r--rrrrrrrrrrr-r--r-rr" edc:impl="0x27FF4B" edc:_addr="0x400E066C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:nzwidth="0x1" edc:desc="UTMI PLL Lock Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 4 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 5 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 6 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 7 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FSMR" edc:nzwidth="0x20" edc:access="--------nnnn-nnnnnnnnnnnnnnnnnnn" edc:impl="0xF7FFFF" edc:_addr="0x400E0670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 0"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 2"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 3"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 4"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 5"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 6"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 7"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 8"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 9"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 10"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 11"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 12"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 13"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 14"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 15"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:nzwidth="0x1" edc:desc="RTT Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:nzwidth="0x1" edc:desc="RTC Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="USBAL" edc:nzwidth="0x1" edc:desc="USB Alarm Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:nzwidth="0x1" edc:desc="Low-power Mode"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:nzwidth="0x2" edc:desc="Flash Low-power Mode">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:nzwidth="0x1" edc:desc="Force Flash Low-power Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FSPR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0674">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 0"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 1"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 2"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 3"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 4"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 5"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 6"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 7"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 8"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 9"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 10"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 11"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 12"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 13"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 14"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarity 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
