Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnn-------n-nnn-nnnnnnn" edc:impl="0x3FF0177F" edc:_addr="0x400E070C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x7" edc:desc="Peripheral ID"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLKCSS" edc:nzwidth="0x3" edc:desc="Generic Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="UPLL Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_CLK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1" edc:desc="Command"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="GCLKDIV" edc:nzwidth="0x8" edc:desc="Generic Clock Division Ratio"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="GCLKEN" edc:nzwidth="0x1" edc:desc="Generic Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OCR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x400E0710">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL4" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL4" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL8" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL12" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 12 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL12" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 12 MHz"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ER0" edc:nzwidth="0x20" edc:access="wwwwwwwwww-ww--w-ww-ww-ww-------" edc:impl="0xFFD96D80" edc:_addr="0x400E0714">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral 7 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral 30 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral 31 SleepWalking Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_DR0" edc:nzwidth="0x20" edc:access="wwwwwwwwww-ww--w-ww-ww-ww-------" edc:impl="0xFFD96D80" edc:_addr="0x400E0718">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral 7 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral 30 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral 31 SleepWalking Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_SR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrr-rr--r-rr-rr-rr-------" edc:impl="0xFFD96D80" edc:_addr="0x400E071C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral 7 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral 30 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral 31 SleepWalking Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ASR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrr-rr--r-rr-rr-rr-------" edc:impl="0xFFD96D80" edc:_addr="0x400E0720">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral 7 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral 30 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral 31 Activity Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400E0724"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PMMR" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnnnnn" edc:impl="0x7FF" edc:_addr="0x400E0730">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLA_MMAX" edc:nzwidth="0xB" edc:desc="PLLA Maximum Allowed Multiplier Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ER1" edc:nzwidth="0x20" edc:access="---wwwww--wwwwwwwwwww--w----wwww" edc:impl="0x1F3FF90F" edc:_addr="0x400E0734">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral 32 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral 33 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral 34 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral 35 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral 40 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral 43 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral 44 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral 45 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral 46 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral 47 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral 48 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral 49 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral 50 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral 51 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral 52 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral 53 SleepWalking Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral 56 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral 57 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral 58 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral 59 SleepWalking Enable"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral 60 SleepWalking Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_DR1" edc:nzwidth="0x20" edc:access="---wwwww--wwwwwwwwwww--w----wwww" edc:impl="0x1F3FF90F" edc:_addr="0x400E0738">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral 32 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral 33 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral 34 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral 35 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral 40 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral 43 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral 44 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral 45 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral 46 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral 47 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral 48 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral 49 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral 50 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral 51 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral 52 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral 53 SleepWalking Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral 56 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral 57 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral 58 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral 59 SleepWalking Disable"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral 60 SleepWalking Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
