Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_SR1" edc:nzwidth="0x20" edc:access="---rrrrr--rrrrrrrrrrr--r----rrrr" edc:impl="0x1F3FF90F" edc:_addr="0x400E073C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral 32 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral 33 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral 34 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral 35 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral 40 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral 43 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral 44 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral 45 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral 46 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral 47 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral 48 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral 49 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral 50 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral 51 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral 52 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral 53 SleepWalking Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral 56 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral 57 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral 58 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral 59 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral 60 SleepWalking Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ASR1" edc:nzwidth="0x20" edc:access="---rrrrr--rrrrrrrrrrr--r----rrrr" edc:impl="0x1F3FF90F" edc:_addr="0x400E0740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral 32 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral 33 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral 34 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral 35 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral 40 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral 43 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral 44 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral 45 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral 46 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral 47 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral 48 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral 49 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral 50 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral 51 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral 52 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral 53 Activity Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral 56 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral 57 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral 58 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral 59 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral 60 Activity Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_AIPR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400E0744">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="AIP" edc:nzwidth="0x1" edc:desc="Activity In Progress"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
