Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="UART0" edc:cname="UART0_RHR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x400E0818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x8" edc:desc="Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART0" edc:cname="UART0_THR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400E081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART0" edc:cname="UART0_BRGR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divisor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART0" edc:cname="UART0_CMPR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn-n-n----nnnnnnnn" edc:impl="0xFF50FF" edc:_addr="0x400E0824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="VAL1" edc:nzwidth="0x8" edc:desc="First Comparison Value for Received Character"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x1" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:nzwidth="0x1" edc:desc="Compare Parity"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:nzwidth="0x8" edc:desc="Second Comparison Value for Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xBC" edc:_addr="0x400E0828"/>
      <edc:SFRDef ltx:memberofperipheral="UART0" edc:cname="UART0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E08E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x554152"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x58" edc:_addr="0x400E08E8"/>
      <edc:SFRDef ltx:memberofperipheral="CHIPID" edc:cname="CHIPID_CIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E0940">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CHIPID">
            <edc:SFRFieldDef edc:cname="VERSION" edc:nzwidth="0x5" edc:desc="Version of the Device"/>
            <edc:SFRFieldDef edc:cname="EPROC" edc:nzwidth="0x3" edc:desc="Embedded Processor">
              <edc:SFRFieldSemantic edc:cname="SAMx7" edc:desc="Cortex-M7" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ARM946ES" edc:desc="ARM946ES" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ARM7TDMI" edc:desc="ARM7TDMI" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CM3" edc:desc="Cortex-M3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ARM920T" edc:desc="ARM920T" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ARM926EJS" edc:desc="ARM926EJS" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CA5" edc:desc="Cortex-A5" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CM4" edc:desc="Cortex-M4" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPSIZ" edc:nzwidth="0x4" edc:desc="Nonvolatile Program Memory Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_160K" edc:desc="160 Kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_1024K" edc:desc="1024 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_2048K" edc:desc="2048 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPSIZ2" edc:nzwidth="0x4" edc:desc="Second Nonvolatile Program Memory Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_1024K" edc:desc="1024 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_2048K" edc:desc="2048 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAMSIZ" edc:nzwidth="0x4" edc:desc="Internal SRAM Size">
              <edc:SFRFieldSemantic edc:cname="_48K" edc:desc="48 Kbytes" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_192K" edc:desc="192 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_384K" edc:desc="384 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_6K" edc:desc="6 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24K" edc:desc="24 Kbytes" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4K" edc:desc="4 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_80K" edc:desc="80 Kbytes" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_160K" edc:desc="160 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="_96K" edc:desc="96 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ARCH" edc:nzwidth="0x8" edc:desc="Architecture Identifier">
              <edc:SFRFieldSemantic edc:cname="SAME70" edc:desc="SAM E70" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="SAMS70" edc:desc="SAM S70" edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="SAMV71" edc:desc="SAM V71" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="SAMV70" edc:desc="SAM V70" edc:when="(field &amp; 0xFF) == 0x13"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPTYP" edc:nzwidth="0x3" edc:desc="Nonvolatile Program Memory Type">
              <edc:SFRFieldSemantic edc:cname="ROM" edc:desc="ROM" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ROMLESS" edc:desc="ROMless or on-chip Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH" edc:desc="Embedded Flash Memory" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ROM_FLASH" edc:desc="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SRAM" edc:desc="SRAM emulating ROM" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="Extension Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CHIPID" edc:cname="CHIPID_EXID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E0944">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CHIPID">
            <edc:SFRFieldDef edc:cname="EXID" edc:nzwidth="0x20" edc:desc="Chip ID Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
