Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="EFC" edc:cname="EEFC_FCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E0C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="FCMD" edc:nzwidth="0x8" edc:desc="Flash Command">
              <edc:SFRFieldSemantic edc:cname="GETD" edc:desc="Get Flash descriptor" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write page" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WPL" edc:desc="Write page and lock" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EWP" edc:desc="Erase page and write page" edc:when="(field &amp; 0xFF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="EWPL" edc:desc="Erase page and write page then lock" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="EA" edc:desc="Erase all" edc:when="(field &amp; 0xFF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="EPA" edc:desc="Erase pages" edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SLB" edc:desc="Set lock bit" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLB" edc:desc="Clear lock bit" edc:when="(field &amp; 0xFF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GLB" edc:desc="Get lock bit" edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SGPB" edc:desc="Set GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CGPB" edc:desc="Clear GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="GGPB" edc:desc="Get GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="STUI" edc:desc="Start read unique identifier" edc:when="(field &amp; 0xFF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SPUI" edc:desc="Stop read unique identifier" edc:when="(field &amp; 0xFF) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="GCALB" edc:desc="Get CALIB bit" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="ES" edc:desc="Erase sector" edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="WUS" edc:desc="Write user signature" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="EUS" edc:desc="Erase user signature" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="STUS" edc:desc="Start read user signature" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="SPUS" edc:desc="Stop read user signature" edc:when="(field &amp; 0xFF) == 0x15"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FARG" edc:nzwidth="0x10" edc:desc="Flash Command Argument"/>
            <edc:SFRFieldDef edc:cname="FKEY" edc:nzwidth="0x8" edc:desc="Flash Writing Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EFC" edc:cname="EEFC_FSR" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x400E0C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Status (cleared when Flash is busy)"/>
            <edc:SFRFieldDef edc:cname="FCMDE" edc:nzwidth="0x1" edc:desc="Flash Command Error Status (cleared on read or by writing EEFC_FCR)"/>
            <edc:SFRFieldDef edc:cname="FLOCKE" edc:nzwidth="0x1" edc:desc="Flash Lock Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FLERR" edc:nzwidth="0x1" edc:desc="Flash Error Status (cleared when a programming operation starts)"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="UECCELSB" edc:nzwidth="0x1" edc:desc="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCELSB" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="UECCEMSB" edc:nzwidth="0x1" edc:desc="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCEMSB" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EFC" edc:cname="EEFC_FRR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E0C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="FVALUE" edc:nzwidth="0x20" edc:desc="Flash Result Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xD4" edc:_addr="0x400E0C10"/>
      <edc:SFRDef ltx:memberofperipheral="EFC" edc:cname="EEFC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E0CE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x454643"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x118" edc:_addr="0x400E0CE8"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_PER" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E0E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="PIO Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_PDR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E0E04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="PIO Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_PSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E0E08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="PIO Status"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="PIO Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E0E0C"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_OER" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E0E10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_ODR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E0E14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Output Disable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Output Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
