Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_ABCDSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400E1478"/>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_IFSCDR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E1480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Peripheral Clock Glitch Filtering Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_IFSCER" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E1484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Slow Clock Debouncing Filtering Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_IFSCSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E1488">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Glitch or Debouncing Filter Selection Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_SCDR" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:impl="0x3FFF" edc:_addr="0x400E148C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xE" edc:desc="Slow Clock Divider Selection for Debouncing"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_PPDDR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E1490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Pull-Down Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOD" edc:cname="PIOD_PPDER" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400E1494">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOD">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Pull-Down Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
