Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn---n--n--nnn------------" edc:impl="0xFF127000" edc:_addr="0x400E1818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="BODRSTEN" edc:nzwidth="0x1" edc:desc="Brownout Detector Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal, vddcore_nreset is asserted when a brownout detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODDIS" edc:nzwidth="0x1" edc:desc="Brownout Detector Disable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core brownout detector is enabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The core brownout detector is disabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ONREG" edc:nzwidth="0x1" edc:desc="Voltage Regulator Enable">
              <edc:SFRFieldSemantic edc:cname="ONREG_UNUSED" edc:desc="Internal voltage regulator is not used (external power supply is used)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ONREG_USED" edc:desc="Internal voltage regulator is used." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BKUPRETON" edc:nzwidth="0x1" edc:desc="SRAM On In Backup Mode"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:nzwidth="0x1" edc:desc="Oscillator Bypass">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on the value of XTALSEL (SUPC_CR)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The 32 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUMR" edc:nzwidth="0x20" edc:access="-------------nnn-nnn----nnn-nnn-" edc:impl="0x770EE" edc:_addr="0x400E181C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The supply monitor detection has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The supply monitor detection forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTTEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The RTT alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTT alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTCEN" edc:nzwidth="0x1" edc:desc="Real-time Clock Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The RTC alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTC alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN0" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Enable WKUP0">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP0 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCEN1" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Enable WKUP1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP1 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCCLR" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Clear">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WKUPDBC" edc:nzwidth="0x3" edc:desc="Wake-up Inputs Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SLCK" edc:desc="WKUPx shall be in its active state for at least 3 SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SLCK" edc:desc="WKUPx shall be in its active state for at least 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SLCK" edc:desc="WKUPx shall be in its active state for at least 512 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SLCK" edc:desc="WKUPx shall be in its active state for at least 4,096 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SLCK" edc:desc="WKUPx shall be in its active state for at least 32,768 SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBC" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUP0/1 in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUP0/1 in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUP0/1 in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUP0/1 in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUP0/1 in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUP0/1 in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUP0/1 in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
