Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SR" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrr-rr-----rrrrrrr-" edc:impl="0x3FFF60FE" edc:_addr="0x400E1824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPS" edc:nzwidth="0x1" edc:desc="WKUP Wake-up Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMWS" edc:nzwidth="0x1" edc:desc="Supply Monitor Detection Wake-up Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:nzwidth="0x1" edc:desc="Brownout Detector Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:nzwidth="0x1" edc:desc="Supply Monitor Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:nzwidth="0x1" edc:desc="Supply Monitor Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:nzwidth="0x1" edc:desc="Supply Monitor Output Status">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:nzwidth="0x1" edc:desc="32-kHz Oscillator Selection Status">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock, SLCK, is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPDBCS0" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Wake-up Status on WKUP0 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCS1" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Wake-up Status on WKUP1 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPIS0" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS1" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS2" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS3" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS4" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS5" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS6" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS7" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS8" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS9" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS10" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS11" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS12" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS13" edc:nzwidth="0x1" edc:desc="WKUPx Input Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400E1828"/>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_MR" edc:nzwidth="0x20" edc:access="-------n---n-nnnnnnnnnnnnnnnnnnn" edc:impl="0x117FFFF" edc:_addr="0x400E1830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:nzwidth="0x10" edc:desc="Real-time Timer Prescaler Value"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Increment Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:nzwidth="0x1" edc:desc="Real-time Timer Restart"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:nzwidth="0x1" edc:desc="Real-time Timer Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:nzwidth="0x1" edc:desc="Real-Time Clock 1Hz Clock Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_AR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:nzwidth="0x20" edc:desc="Alarm Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_VR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E1838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:nzwidth="0x20" edc:desc="Current Real-time Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_SR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x400E183C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:nzwidth="0x1" edc:desc="Real-time Alarm Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:nzwidth="0x1" edc:desc="Prescaler Roll-over Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x400E1840"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDT_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-----------------------w" edc:impl="0xFF000001" edc:_addr="0x400E1850">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
