Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70J19B.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC5" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP7" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC6" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC7" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODCEN1" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PIODCCLK" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANTX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANRX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS1"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C" ltx:memberofperipheral="MLB"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS1"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C" ltx:memberofperipheral="MLB"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDIO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="ERASE" edc:ppsfunction="X1" ltx:memberofperipheral="EFC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="TRACED0" edc:ppsfunction="C" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="TRACED1" edc:ppsfunction="C" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="TRACED2" edc:ppsfunction="C" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="TRACED3" edc:ppsfunction="C" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TRACECLK" edc:ppsfunction="D" ltx:memberofperipheral="TPIU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C" ltx:memberofperipheral="AFEC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="MLBSIG" edc:ppsfunction="D" ltx:memberofperipheral="MLB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C" ltx:memberofperipheral="UART2"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C" ltx:memberofperipheral="UART2"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D" ltx:memberofperipheral="UART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
